Jerruce/horometro2021_atmega328p/horometro_2021/app/esp32_comm_interface.c
/*
 * esp32_comm_interface.c
 *
 * Created: 17/06/2021 12:40:04
 *  Author: mtorres
 */ 

/* File inclusion */
#include "esp32_comm_interface.h"

/* Variable definition */

static uint32_t esp32_timeout_counter = 0;

// Data buffers for ESP32
static uint8_t esp32_buffer_operation_mode = VIBRATION_SENSOR_ONLY_MODE;
static uint8_t esp32_buffer_date[3] = {0, 0, 0};
static uint8_t esp32_buffer_time[3] = {0, 0, 0};
static uint8_t esp32_buffer_alarms_status = 0;
static uint32_t esp32_buffer_alarm1_setpoint = 0;
static uint32_t esp32_buffer_alarm2_setpoint = 0;
static uint32_t esp32_buffer_alarm3_setpoint = 0;
static uint32_t esp32_buffer_alarm1_counter = 0;
static uint32_t esp32_buffer_alarm2_counter = 0;
static uint32_t esp32_buffer_alarm3_counter = 0;
static uint32_t esp32_buffer_motor_counter = 0;
static uint16_t esp32_buffer_motor_speed = 0;
static uint32_t esp32_buffer_motor_current = 0;
static uint8_t esp32_buffer_battery_level = 0; 

static uint16_t esp32_buffer_param_status = 0;

// Buffers for SPI bus
static uint8_t spi_tx_buffer[SPI_TX_BUFF_SIZE];
static uint8_t spi_rx_buffer[SPI_RX_BUFF_SIZE];


/* Function definition */

void SPI1_Initialize(void){

	spi_config_t my_spi;
	
	/* Configurar el módulo SPI para trabajar en Modo 0 a 64 KHz */
	my_spi.mode = SPI_Master;
	my_spi.sck_prescaler = SCK_Fosc_2;
	my_spi.cpol = CPOL_0;
	my_spi.cpha = CPHA_0;
	my_spi.data_order = MSB_First;
	my_spi.interrupt = SPI_Int_Disabled;

	SPI1_Configurar(&my_spi);
}


void ESP32_Comm_Interface_Initialize(void){
	
	/* Configure as input and enable pull-up of the handshaking (mcu feedback) pin */
	DDR_MCU_FEEDBACK_HANDSHAKE &= ~(1 << MCU_FEEDBACK_HANDSHAKE);
	PORT_MCU_FEEDBACK_HANDSHAKE |= (1 << MCU_FEEDBACK_HANDSHAKE);
	
	/* Configure the chip select pin as output and initialize in HIGH */
	DDR_MCU_TO_MCU_CS |= (1 << MCU_TO_MCU_CS);
	PORT_MCU_TO_MCU_CS |= (1 << MCU_TO_MCU_CS);
	
	/* Configure the SPI in Master mode */
	SPI1_Initialize();
	
 }



uint8_t ESP32_Turn_On(void){
	
	uint8_t result = DATA_COMM_IN_PROGESS;
	static uint8_t seq_state = 0;
	
	switch(seq_state){
		
	case 0:
		ESP32_Microcontroller_PSU_On();
		seq_state++;
		esp32_timeout_counter = 0;
		break;		
		
	case 1:
	
		esp32_timeout_counter++;
		if(esp32_timeout_counter >= ESP32_COMM_TIMEOUT_VALUE){
			esp32_timeout_counter = 0;
			seq_state = 0;
			result = DATA_COMM_SUCCESS;
		}	
		
		break;
		 	
	default:
		break;	
		
	}
	
	return result;
	
}


uint8_t ESP32_Turn_Off(void){
	
	uint8_t result = DATA_COMM_IN_PROGESS;
	static uint8_t seq_state = 0;
	
	switch(seq_state){
		
	case 0:
		esp32_timeout_counter = 0;
		seq_state++;
		break;
		
	case 1:	
	
		if(PIN_MCU_FEEDBACK_HANDSHAKE & (1 << MCU_FEEDBACK_HANDSHAKE)){
			esp32_timeout_counter++;
			if(esp32_timeout_counter >= ESP32_COMM_TIMEOUT_VALUE){
				esp32_timeout_counter = 0;
				seq_state = 5;
			}	
		}else{
			esp32_timeout_counter = 0;
			seq_state++;
		}
		
		break;
		
	case 2:
	
		SPI1_Master_Tx_Byte(ESP32_TURN_OFF_WRITE_CMD);
		seq_state++;
	
		break;	
	
	
	case 3:

		if(PIN_MCU_FEEDBACK_HANDSHAKE & (1 << MCU_FEEDBACK_HANDSHAKE)){
			esp32_timeout_counter++;
			if(esp32_timeout_counter >= ESP32_COMM_TIMEOUT_VALUE){
				esp32_timeout_counter = 0;
				seq_state = 5;
			}
		}else{
			esp32_timeout_counter = 0;
			seq_state++;
		}
		
		break;
		
	case 4:
		
		ESP32_Microcontroller_PSU_Off();
		seq_state = 0;
		result = DATA_COMM_SUCCESS;
					
		break;
		
	case 5:
	
		ESP32_Microcontroller_PSU_Off();
		seq_state = 0;
		result = DATA_COMM_FAIL;
		
		break;		
		
	default:
		break;	
		
	}
		
	return result;
}


uint8_t ESP32_WiFi_Enable(void){

	uint8_t result = DATA_COMM_IN_PROGESS;
	static uint8_t seq_state = 0;
	
	switch(seq_state){
		
	case 0:
		esp32_timeout_counter = 0;
		seq_state++;
		break;
		
	case 1:
		
		if(PIN_MCU_FEEDBACK_HANDSHAKE & (1 << MCU_FEEDBACK_HANDSHAKE)){
			esp32_timeout_counter++;
			if(esp32_timeout_counter >= ESP32_COMM_TIMEOUT_VALUE){
				esp32_timeout_counter = 0;
				seq_state = 5;
			}
		}else{
			esp32_timeout_counter = 0;
			seq_state++;
		}
		
		break;
		
	case 2:
		
		SPI1_Master_Tx_Byte(ESP32_WIFI_ENABLE_WRITE_CMD);
		seq_state++;
		
		break;
		
		
	case 3:

		if(PIN_MCU_FEEDBACK_HANDSHAKE & (1 << MCU_FEEDBACK_HANDSHAKE)){
			esp32_timeout_counter++;
			if(esp32_timeout_counter >= ESP32_COMM_TIMEOUT_VALUE){
				esp32_timeout_counter = 0;
				seq_state = 5;
			}
			}else{
			esp32_timeout_counter = 0;
			seq_state++;
		}
		
		break;
		
	case 4:
		
		seq_state = 0;
		result = DATA_COMM_SUCCESS;
		
		break;
		
	case 5:
		
		seq_state = 0;
		result = DATA_COMM_FAIL;
		
		break;
		
		default:
		break;
		
	}
	
	return result;
	
}


uint8_t ESP32_WiFi_Disable(void){

	uint8_t result = DATA_COMM_IN_PROGESS;
	static uint8_t seq_state = 0;
	
	switch(seq_state){
		
	case 0:
		esp32_timeout_counter = 0;
		seq_state++;
		break;
		
	case 1:
		
		if(PIN_MCU_FEEDBACK_HANDSHAKE & (1 << MCU_FEEDBACK_HANDSHAKE)){
			esp32_timeout_counter++;
			if(esp32_timeout_counter >= ESP32_COMM_TIMEOUT_VALUE){
				esp32_timeout_counter = 0;
				seq_state = 5;
			}
		}else{
			esp32_timeout_counter = 0;
			seq_state++;
		}
		
		break;
		
	case 2:
		
		SPI1_Master_Tx_Byte(ESP32_WIFI_DISABLE_WRITE_CMD);
		seq_state++;
		
		break;
		
		
	case 3:

		if(PIN_MCU_FEEDBACK_HANDSHAKE & (1 << MCU_FEEDBACK_HANDSHAKE)){
			esp32_timeout_counter++;
			if(esp32_timeout_counter >= ESP32_COMM_TIMEOUT_VALUE){
				esp32_timeout_counter = 0;
				seq_state = 5;
			}
		}else{
			esp32_timeout_counter = 0;
			seq_state++;
		}
		
		break;
		
	case 4:
		
		seq_state = 0;
		result = DATA_COMM_SUCCESS;
		
		break;
		
	case 5:
		
		seq_state = 0;
		result = DATA_COMM_FAIL;
		
		break;
		
	default:
		break;
		
	}
	
	return result;
}


uint8_t ESP32_Epaper_Display_Update(void){
	
	uint8_t result = DATA_COMM_IN_PROGESS;
	static uint8_t seq_state = 0;
	
	switch(seq_state){
		
		case 0:
		esp32_timeout_counter = 0;
		seq_state++;
		break;
		
	case 1:
		
		if(PIN_MCU_FEEDBACK_HANDSHAKE & (1 << MCU_FEEDBACK_HANDSHAKE)){
			esp32_timeout_counter++;
			if(esp32_timeout_counter >= ESP32_COMM_TIMEOUT_VALUE){
				esp32_timeout_counter = 0;
				seq_state = 5;
			}
		}else{
			esp32_timeout_counter = 0;
			seq_state++;
		}
		break;
		
