Jerruce/horometro2021_atmega328p/horometro_2021/app/esp32_comm_interface.c
	case 2:
		
		SPI1_Master_Tx_Byte(ESP32_EPAPER_UPDATE_WRITE_CMD);
		seq_state++;
		break;
		
	case 3:

		if(PIN_MCU_FEEDBACK_HANDSHAKE & (1 << MCU_FEEDBACK_HANDSHAKE)){
			esp32_timeout_counter++;
			if(esp32_timeout_counter >= ESP32_COMM_TIMEOUT_VALUE){
				esp32_timeout_counter = 0;
				seq_state = 5;
			}
		}else{
			esp32_timeout_counter = 0;
			seq_state++;
		}
		break;
		
	case 4:
		
		seq_state = 0;
		result = DATA_COMM_SUCCESS;
		break;
		
	case 5:
		
		seq_state = 0;
		result = DATA_COMM_FAIL;
		break;
		
	default:
		break;
		
	}
	
	return result;	
	
	
}


uint8_t ESP32_Operation_Mode_Write(void){

	uint8_t result = DATA_COMM_IN_PROGESS;
	static uint8_t seq_state = 0;
	
	switch(seq_state){
		
	case 0:
	
		esp32_timeout_counter = 0;
		seq_state++;
		break;		

	case 1:
	
		if(PIN_MCU_FEEDBACK_HANDSHAKE & (1 << MCU_FEEDBACK_HANDSHAKE)){
			esp32_timeout_counter++;
			if(esp32_timeout_counter >= ESP32_COMM_TIMEOUT_VALUE){
				esp32_timeout_counter = 0;
				seq_state = 5;
			}
		}else{
			esp32_timeout_counter = 0;
			seq_state++;
		}
		break;
		
	case 2:
	
		SPI1_Master_Tx_Byte(ESP32_OP_MODE_WRITE_CMD);
		seq_state++;
	
		break;
		
	case 3:
	
		if(PIN_MCU_FEEDBACK_HANDSHAKE & (1 << MCU_FEEDBACK_HANDSHAKE)){
			esp32_timeout_counter++;
			if(esp32_timeout_counter >= ESP32_COMM_TIMEOUT_VALUE){
				esp32_timeout_counter = 0;
				seq_state = 5;
			}
		}else{
			esp32_timeout_counter = 0;
			seq_state++;
		}		
		break;	

	case 4:
	
		SPI1_Master_Tx_Byte(esp32_buffer_operation_mode);
		seq_state = 0;
		result = DATA_COMM_SUCCESS;
		break;	

	case 5:
	
		seq_state = 0;
		result = DATA_COMM_FAIL;
		break;
		
	default:
		break;	
		
	}
	
	return result;	
}


uint8_t ESP32_Date_And_Time_Write(void){

	uint8_t result = DATA_COMM_IN_PROGESS;
	static uint8_t seq_state = 0;
	
	switch(seq_state){
		
	case 0:
		
		esp32_timeout_counter = 0;
		seq_state++;
		break;

	case 1:
		
		if(PIN_MCU_FEEDBACK_HANDSHAKE & (1 << MCU_FEEDBACK_HANDSHAKE)){
			esp32_timeout_counter++;
			if(esp32_timeout_counter >= ESP32_COMM_TIMEOUT_VALUE){
				esp32_timeout_counter = 0;
				seq_state = 5;
			}
			}else{
			esp32_timeout_counter = 0;
			seq_state++;
		}
		break;
		
	case 2:
		
		SPI1_Master_Tx_Byte(ESP32_DATE_AND_TIME_WRITE_CMD);
		seq_state++;
		
		break;
		
	case 3:
		
		if(PIN_MCU_FEEDBACK_HANDSHAKE & (1 << MCU_FEEDBACK_HANDSHAKE)){
			esp32_timeout_counter++;
			if(esp32_timeout_counter >= ESP32_COMM_TIMEOUT_VALUE){
				esp32_timeout_counter = 0;
				seq_state = 5;
			}
		}else{
			esp32_timeout_counter = 0;
			seq_state++;
		}
		break;

	case 4:
		
		spi_tx_buffer[0] = esp32_buffer_date[0];
		spi_tx_buffer[1] = esp32_buffer_date[1];
		spi_tx_buffer[2] = esp32_buffer_date[2];
		spi_tx_buffer[3] = esp32_buffer_time[0];
		spi_tx_buffer[4] = esp32_buffer_time[1];
		spi_tx_buffer[5] = esp32_buffer_time[2];
		
		SPI1_Master_Tx_Bitstream(6, spi_tx_buffer, spi_rx_buffer);
		seq_state = 0;
		result = DATA_COMM_SUCCESS;
		break;

	case 5:
		
		seq_state = 0;
		result = DATA_COMM_FAIL;
		break;
		
	default:
		break;
		
	}	
	
	return result;
}


uint8_t ESP32_Alarms_Status_Write(void){

	uint8_t result = DATA_COMM_IN_PROGESS;
	static uint8_t seq_state = 0;

	switch(seq_state){
		
	case 0:
		
		esp32_timeout_counter = 0;
		seq_state++;
		break;

	case 1:
		
		if(PIN_MCU_FEEDBACK_HANDSHAKE & (1 << MCU_FEEDBACK_HANDSHAKE)){
			esp32_timeout_counter++;
			if(esp32_timeout_counter >= ESP32_COMM_TIMEOUT_VALUE){
				esp32_timeout_counter = 0;
				seq_state = 5;
			}
			}else{
			esp32_timeout_counter = 0;
			seq_state++;
		}
		break;
		
	case 2:
		
		SPI1_Master_Tx_Byte(ESP32_ALARMS_STATUS_WRITE_CMD);
		seq_state++;
		break;
		
	case 3:
		
		if(PIN_MCU_FEEDBACK_HANDSHAKE & (1 << MCU_FEEDBACK_HANDSHAKE)){
			esp32_timeout_counter++;
			if(esp32_timeout_counter >= ESP32_COMM_TIMEOUT_VALUE){
				esp32_timeout_counter = 0;
				seq_state = 5;
			}
			}else{
			esp32_timeout_counter = 0;
			seq_state++;
		}
		break;

	case 4:
	
		SPI1_Master_Tx_Byte(esp32_buffer_alarms_status);
		seq_state = 0;
		result = DATA_COMM_SUCCESS;
		break;

	case 5:
		
		seq_state = 0;
		result = DATA_COMM_FAIL;
		break;
		
	default:
		break;
		
	}
	
	
	return result;
}


uint8_t ESP32_Alarm1_Setpoint_Write(void){

	uint8_t result = DATA_COMM_IN_PROGESS;
	static uint8_t seq_state = 0;
	
	switch(seq_state){
		
	case 0:
		
		esp32_timeout_counter = 0;
		seq_state++;
		break;

	case 1:
		
		if(PIN_MCU_FEEDBACK_HANDSHAKE & (1 << MCU_FEEDBACK_HANDSHAKE)){
			esp32_timeout_counter++;
			if(esp32_timeout_counter >= ESP32_COMM_TIMEOUT_VALUE){
				esp32_timeout_counter = 0;
				seq_state = 5;
			}
		}else{
			esp32_timeout_counter = 0;
			seq_state++;
		}
		break;
		
	case 2:
		
		SPI1_Master_Tx_Byte(ESP32_ALARM1_SETPOINT_WRITE_CMD);
		seq_state++;
		
		break;
		
	case 3:
		
		if(PIN_MCU_FEEDBACK_HANDSHAKE & (1 << MCU_FEEDBACK_HANDSHAKE)){
			esp32_timeout_counter++;
			if(esp32_timeout_counter >= ESP32_COMM_TIMEOUT_VALUE){
				esp32_timeout_counter = 0;
				seq_state = 5;
			}
		}else{
			esp32_timeout_counter = 0;
			seq_state++;
		}
		break;

	case 4:
		
		spi_tx_buffer[0] = esp32_buffer_alarm1_setpoint & 0x000000FF;
		spi_tx_buffer[1] = (esp32_buffer_alarm1_setpoint >> 8) & 0x000000FF;
		spi_tx_buffer[2] = (esp32_buffer_alarm1_setpoint >> 16) & 0x000000FF;
		spi_tx_buffer[3] = (esp32_buffer_alarm1_setpoint >> 24) & 0x000000FF;
		
		SPI1_Master_Tx_Bitstream(4, spi_tx_buffer, spi_rx_buffer);
		seq_state = 0;
		result = DATA_COMM_SUCCESS;
		break;

	case 5:
		
		seq_state = 0;
		result = DATA_COMM_FAIL;
		break;
		
	default:
		break;
		
	}
	
	return result;
	
}


uint8_t ESP32_Alarm2_Setpoint_Write(void){

	uint8_t result = DATA_COMM_IN_PROGESS;
	static uint8_t seq_state = 0;
	
	switch(seq_state){
		
	case 0:
		
		esp32_timeout_counter = 0;
		seq_state++;
		break;

	case 1:
		
		if(PIN_MCU_FEEDBACK_HANDSHAKE & (1 << MCU_FEEDBACK_HANDSHAKE)){
			esp32_timeout_counter++;
			if(esp32_timeout_counter >= ESP32_COMM_TIMEOUT_VALUE){
				esp32_timeout_counter = 0;
				seq_state = 5;
			}
		}else{
			esp32_timeout_counter = 0;
			seq_state++;
		}
		break;
		
