Jerruce/horometro2021_atmega328p/horometro_2021/app/esp32_comm_interface.c
		seq_state = 0;
		result = DATA_COMM_FAIL;
		break;
		
	default:
		break;
		
	}
	
	return result;
	
}



uint8_t ESP32_Operation_Mode_Read(void){

	uint8_t result = DATA_COMM_IN_PROGESS;
	static uint8_t seq_state = 0;
	
	switch(seq_state){
		
	case 0:
		
		esp32_timeout_counter = 0;
		seq_state++;
		break;

	case 1:
		
		if(PIN_MCU_FEEDBACK_HANDSHAKE & (1 << MCU_FEEDBACK_HANDSHAKE)){
			esp32_timeout_counter++;
			if(esp32_timeout_counter >= ESP32_COMM_TIMEOUT_VALUE){
				esp32_timeout_counter = 0;
				seq_state = 5;
			}
			}else{
			esp32_timeout_counter = 0;
			seq_state++;
		}
		break;
		
	case 2:
		
		SPI1_Master_Tx_Byte(ESP32_OP_MODE_READ_CMD);
		seq_state++;
		
		break;
		
	case 3:
		
		if(PIN_MCU_FEEDBACK_HANDSHAKE & (1 << MCU_FEEDBACK_HANDSHAKE)){
			esp32_timeout_counter++;
			if(esp32_timeout_counter >= ESP32_COMM_TIMEOUT_VALUE){
				esp32_timeout_counter = 0;
				seq_state = 5;
			}
		}else{
			esp32_timeout_counter = 0;
			seq_state++;
		}
		break;

	case 4:
		
		esp32_buffer_operation_mode = SPI1_Master_Tx_Byte(0x00);
		seq_state = 0;
		result = DATA_COMM_SUCCESS;
		break;

	case 5:
		
		seq_state = 0;
		result = DATA_COMM_FAIL;
		break;
		
	default:
		break;
		
	}
	
	return result;
	
}



uint8_t ESP32_Date_And_Time_Read(void){

	uint8_t result = DATA_COMM_IN_PROGESS;
	static uint8_t seq_state = 0;
	
	switch(seq_state){
		
	case 0:
		
		esp32_timeout_counter = 0;
		seq_state++;
		break;

	case 1:
		
		if(PIN_MCU_FEEDBACK_HANDSHAKE & (1 << MCU_FEEDBACK_HANDSHAKE)){
			esp32_timeout_counter++;
			if(esp32_timeout_counter >= ESP32_COMM_TIMEOUT_VALUE){
				esp32_timeout_counter = 0;
				seq_state = 5;
			}
		}else{
			esp32_timeout_counter = 0;
			seq_state++;
		}
		break;
		
	case 2:
		
		SPI1_Master_Tx_Byte(ESP32_DATE_AND_TIME_READ_CMD);
		seq_state++;
		
		break;
		
	case 3:
		
		if(PIN_MCU_FEEDBACK_HANDSHAKE & (1 << MCU_FEEDBACK_HANDSHAKE)){
			esp32_timeout_counter++;
			if(esp32_timeout_counter >= ESP32_COMM_TIMEOUT_VALUE){
				esp32_timeout_counter = 0;
				seq_state = 5;
			}
		}else{
			esp32_timeout_counter = 0;
			seq_state++;
		}
		break;

	case 4:
		
		SPI1_Master_Tx_Bitstream(6, spi_tx_buffer, spi_rx_buffer);
		esp32_buffer_date[0] = spi_rx_buffer[0];
		esp32_buffer_date[1] = spi_rx_buffer[1];
		esp32_buffer_date[2] = spi_rx_buffer[2];
		esp32_buffer_time[0] = spi_rx_buffer[3];
		esp32_buffer_time[1] = spi_rx_buffer[4];
		esp32_buffer_time[2] = spi_rx_buffer[5];
		
		seq_state = 0;
		result = DATA_COMM_SUCCESS;
		break;

	case 5:
		
		seq_state = 0;
		result = DATA_COMM_FAIL;
		break;
		
	default:
		break;
		
	}
	
	return result;
	
}


uint8_t ESP32_Alarm1_Setpoint_Read(void){

	uint8_t result = DATA_COMM_IN_PROGESS;
	static uint8_t seq_state = 0;
	
	switch(seq_state){
		
	case 0:
		
		esp32_timeout_counter = 0;
		seq_state++;
		break;

	case 1:
		
		if(PIN_MCU_FEEDBACK_HANDSHAKE & (1 << MCU_FEEDBACK_HANDSHAKE)){
			esp32_timeout_counter++;
			if(esp32_timeout_counter >= ESP32_COMM_TIMEOUT_VALUE){
				esp32_timeout_counter = 0;
				seq_state = 5;
			}
		}else{
			esp32_timeout_counter = 0;
			seq_state++;
		}
		break;
		
	case 2:
		
		SPI1_Master_Tx_Byte(ESP32_ALARM1_SETPOINT_READ_CMD);
		seq_state++;
		
		break;
		
	case 3:
		
		if(PIN_MCU_FEEDBACK_HANDSHAKE & (1 << MCU_FEEDBACK_HANDSHAKE)){
			esp32_timeout_counter++;
			if(esp32_timeout_counter >= ESP32_COMM_TIMEOUT_VALUE){
				esp32_timeout_counter = 0;
				seq_state = 5;
			}
		}else{
			esp32_timeout_counter = 0;
			seq_state++;
		}
		break;

	case 4:
		
		SPI1_Master_Tx_Bitstream(4, spi_tx_buffer, spi_rx_buffer);
		esp32_buffer_alarm1_setpoint = (((uint32_t)spi_rx_buffer[3]) << 24) | (((uint32_t)spi_rx_buffer[2]) << 16) | (((uint32_t)spi_rx_buffer[1]) << 8) | (spi_rx_buffer[0]);
		seq_state = 0;
		result = DATA_COMM_SUCCESS;
		break;

	case 5:
		
		seq_state = 0;
		result = DATA_COMM_FAIL;
		break;
		
	default:
		break;
		
	}
	
	return result;
	
}


uint8_t ESP32_Alarm2_Setpoint_Read(void){

	uint8_t result = DATA_COMM_IN_PROGESS;
	static uint8_t seq_state = 0;
	
	switch(seq_state){
		
	case 0:
		
		esp32_timeout_counter = 0;
		seq_state++;
		break;

	case 1:
		
		if(PIN_MCU_FEEDBACK_HANDSHAKE & (1 << MCU_FEEDBACK_HANDSHAKE)){
			esp32_timeout_counter++;
			if(esp32_timeout_counter >= ESP32_COMM_TIMEOUT_VALUE){
				esp32_timeout_counter = 0;
				seq_state = 5;
			}
		}else{
			esp32_timeout_counter = 0;
			seq_state++;
		}
		break;
		
	case 2:
		
		SPI1_Master_Tx_Byte(ESP32_ALARM2_SETPOINT_READ_CMD);
		seq_state++;
		
		break;
		
	case 3:
		
		if(PIN_MCU_FEEDBACK_HANDSHAKE & (1 << MCU_FEEDBACK_HANDSHAKE)){
			esp32_timeout_counter++;
			if(esp32_timeout_counter >= ESP32_COMM_TIMEOUT_VALUE){
				esp32_timeout_counter = 0;
				seq_state = 5;
			}
		}else{
			esp32_timeout_counter = 0;
			seq_state++;
		}
		break;

	case 4:
		
		SPI1_Master_Tx_Bitstream(4, spi_tx_buffer, spi_rx_buffer);
		esp32_buffer_alarm2_setpoint = (((uint32_t)spi_rx_buffer[3]) << 24) | (((uint32_t)spi_rx_buffer[2]) << 16) | (((uint32_t)spi_rx_buffer[1]) << 8) | (spi_rx_buffer[0]);
		seq_state = 0;
		result = DATA_COMM_SUCCESS;
		break;

	case 5:
		
		seq_state = 0;
		result = DATA_COMM_FAIL;
		break;
		
	default:
		break;
		
	}
	
	return result;
	
}


uint8_t ESP32_Alarm3_Setpoint_Read(void){

	uint8_t result = DATA_COMM_IN_PROGESS;
	static uint8_t seq_state = 0;
	
	switch(seq_state){
		
	case 0:
		
		esp32_timeout_counter = 0;
		seq_state++;
		break;

	case 1:
		
		if(PIN_MCU_FEEDBACK_HANDSHAKE & (1 << MCU_FEEDBACK_HANDSHAKE)){
			esp32_timeout_counter++;
			if(esp32_timeout_counter >= ESP32_COMM_TIMEOUT_VALUE){
				esp32_timeout_counter = 0;
				seq_state = 5;
			}
		}else{
			esp32_timeout_counter = 0;
			seq_state++;
		}
		break;
		
	case 2:
		
		SPI1_Master_Tx_Byte(ESP32_ALARM3_SETPOINT_READ_CMD);
		seq_state++;
		
		break;
		
	case 3:
		
		if(PIN_MCU_FEEDBACK_HANDSHAKE & (1 << MCU_FEEDBACK_HANDSHAKE)){
			esp32_timeout_counter++;
			if(esp32_timeout_counter >= ESP32_COMM_TIMEOUT_VALUE){
				esp32_timeout_counter = 0;
				seq_state = 5;
			}
		}else{
			esp32_timeout_counter = 0;
			seq_state++;
		}
		break;

	case 4:
		
		SPI1_Master_Tx_Bitstream(4, spi_tx_buffer, spi_rx_buffer);
		esp32_buffer_alarm3_setpoint = (((uint32_t)spi_rx_buffer[3]) << 24) | (((uint32_t)spi_rx_buffer[2]) << 16) | (((uint32_t)spi_rx_buffer[1]) << 8) | (spi_rx_buffer[0]);
		seq_state = 0;
		result = DATA_COMM_SUCCESS;
		break;

	case 5:
		
