Jerruce/horometro2021_atmega328p/horometro_2021/app/esp32_comm_interface.c
		seq_state = 0;
		result = DATA_COMM_FAIL;
		break;
		
	default:
		break;
		
	}
	
	return result;
	
}


void ESP32_Buffer_Operation_Mode_Set(uint8_t new_mode){
	esp32_buffer_operation_mode = new_mode;
}


void ESP32_Buffer_Date_And_Time_Set(uint8_t *new_date, uint8_t *new_time){
	esp32_buffer_date[0] = *new_date;
	esp32_buffer_date[1] = *(new_date + 1);
	esp32_buffer_date[2] = *(new_date + 2);
	
	esp32_buffer_time[0] = *new_time;
	esp32_buffer_time[1] = *(new_time + 1);
	esp32_buffer_time[2] = *(new_time + 2);
}


void ESP32_Buffer_Alarms_Status_Set(uint8_t new_alarms_status){
	esp32_buffer_alarms_status = new_alarms_status;
}


void ESP32_Buffer_Alarm1_Setpoint_Set(uint32_t new_setpoint){
	esp32_buffer_alarm1_setpoint = new_setpoint;
}


void ESP32_Buffer_Alarm2_Setpoint_Set(uint32_t new_setpoint){
	esp32_buffer_alarm2_setpoint = new_setpoint;
}


void ESP32_Buffer_Alarm3_Setpoint_Set(uint32_t new_setpoint){
	esp32_buffer_alarm3_setpoint = new_setpoint;
}


void ESP32_Buffer_Alarm1_Counter_Set(uint32_t new_counter){
	esp32_buffer_alarm1_counter = new_counter;
}


void ESP32_Buffer_Alarm2_Counter_Set(uint32_t new_counter){
	esp32_buffer_alarm2_counter = new_counter;
}


void ESP32_Buffer_Alarm3_Counter_Set(uint32_t new_counter){
	esp32_buffer_alarm3_counter = new_counter;
}


void ESP32_Buffer_Motor_Counter_Set(uint32_t new_counter){
	esp32_buffer_motor_counter = new_counter;
}


void ESP32_Buffer_Motor_Speed_Set(uint32_t new_speed){
	esp32_buffer_motor_speed = new_speed;
}


void ESP32_Buffer_Motor_Current_Set(uint32_t new_current){
	esp32_buffer_motor_current = new_current;
}


void ESP32_Buffer_Battery_Level_Set(uint32_t new_level){
	esp32_buffer_battery_level = new_level;
}


uint16_t ESP32_Buffer_Parameters_Status_Get(void){
	return esp32_buffer_param_status;
}


uint8_t ESP32_Buffer_Operation_Mode_Get(void){
	return esp32_buffer_operation_mode;
}


void ESP32_Buffer_Date_And_Time_Get(uint8_t *new_date, uint8_t *new_time){
	*new_date = esp32_buffer_date[0];
	*(new_date + 1) = esp32_buffer_date[1];
	*(new_date + 2) = esp32_buffer_date[2];
	
	*new_time = esp32_buffer_time[0];
	*(new_time + 1) = esp32_buffer_time[1];
	*(new_time + 2) = esp32_buffer_time[2];	
}


uint32_t ESP32_Buffer_Alarm1_Setpoint_Get(void){
	return esp32_buffer_alarm1_setpoint;
}


uint32_t ESP32_Buffer_Alarm2_Setpoint_Get(void){
	return esp32_buffer_alarm2_setpoint;
}


uint32_t ESP32_Buffer_Alarm3_Setpoint_Get(void){
	return esp32_buffer_alarm3_setpoint;
}
